---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstraint.IsFixedDistanceToHostFace
source: html/b81e57f3-802d-3fa9-2e0f-3ec2b26b48cb.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraint.IsFixedDistanceToHostFace Method

Returns true if the RebarConstraintType of the RebarConstraint is 'FixedDistanceToHostFace.'

## Syntax (C#)
```csharp
public bool IsFixedDistanceToHostFace()
```